export const regionTree = [
    {
        region: "北海道・東北",
        prefs: [
            { name: "北海道", cities: ["札幌", "北海道"] },
            { name: "青森", cities: ["青森"] },
            { name: "岩手", cities: ["岩手"] },
            { name: "宮城", cities: ["仙台", "宮城"] },
            { name: "秋田", cities: ["秋田"] },
            { name: "山形", cities: ["山形"] },
            { name: "福島", cities: ["福島"] }
        ]
    },
    {
        region: "関東",
        prefs: [
            { name: "茨城", cities: ["水戸", "ひたちなか", "日立", "土浦", "古河", "つくば", "鹿嶋", "守谷", "筑西", "坂東", "神栖", "茨城"] },
            { name: "栃木", cities: ["宇都宮", "栃木"] },
            { name: "群馬", cities: ["前橋", "高崎", "群馬"] },
            { name: "埼玉", cities: ["さいたま", "所沢", "川越", "ふじみ野", "川口", "熊谷", "行田", "秩父", "飯能", "加須", "本庄", "東松山", "春日部", "狭山", "羽生", "鴻巣", "深谷", "上尾", "草加", "越谷", "蕨", "戸田", "入間", "朝霞", "志木", "和光", "新座", "久喜", "北本", "八潮", "富士見", "三郷", "蓮田", "坂戸", "幸手", "鶴ヶ島", "日高", "吉川", "白岡", "埼玉"] },
            {
                name: "東京（23区）",
                cities: [
                    "千代田", "中央", "港", "新宿", "文京", "台東", "墨田", "江東",
                    "品川", "目黒", "大田", "世田谷", "渋谷", "中野", "杉並", "豊島", "北",
                    "荒川", "板橋", "練馬", "足立", "葛飾", "江戸川"
                ]
            },
            {
                name: "東京（市町村）",
                cities: [
                    "八王子", "立川", "武蔵野", "三鷹", "青梅", "府中", "昭島", "調布",
                    "町田", "小金井", "小平", "日野", "東村山", "国分寺", "国立", "福生",
                    "狛江", "東大和", "清瀬", "東久留米", "武蔵村山", "多摩", "稲城",
                    "羽村", "あきる野", "西東京"
                ]
            },
            { name: "神奈川", cities: ["横浜", "川崎", "相模原", "横須賀", "平塚", "鎌倉", "藤沢", "小田原", "茅ヶ崎", "逗子", "三浦", "秦野", "厚木", "大和", "伊勢原", "海老名", "座間", "南足柄", "綾瀬", "神奈川"] },
            { name: "千葉", cities: ["千葉", "市川", "船橋", "松戸", "野田", "茂原", "成田", "佐倉", "東金", "習志野", "柏", "勝浦", "市原", "流山", "八千代", "我孫子", "鴨川", "鎌ケ谷", "君津", "浦安", "四街道"] }
        ]
    },
    {
        region: "中部・北陸",
        prefs: [
            { name: "新潟", cities: ["新潟"] },
            { name: "富山", cities: ["富山"] },
            { name: "石川", cities: ["石川"] },
            { name: "福井", cities: ["福井"] },
            { name: "山梨", cities: ["山梨"] },
            { name: "長野", cities: ["長野"] },
            { name: "岐阜", cities: ["岐阜"] },
            { name: "静岡", cities: ["静岡", "浜松"] },
            { name: "愛知", cities: ["名古屋", "愛知"] }
        ]
    },
    {
        region: "近畿",
        prefs: [
            { name: "三重", cities: ["三重"] },
            { name: "滋賀", cities: ["滋賀"] },
            { name: "京都", cities: ["京都"] },
            { name: "大阪", cities: ["大阪", "堺"] },
            { name: "兵庫", cities: ["神戸", "兵庫"] },
            { name: "奈良", cities: ["奈良"] },
            { name: "和歌山", cities: ["和歌山"] }
        ]
    },
    {
        region: "中国・四国",
        prefs: [
            { name: "鳥取", cities: ["鳥取"] },
            { name: "島根", cities: ["島根"] },
            { name: "岡山", cities: ["岡山"] },
            { name: "広島", cities: ["広島"] },
            { name: "山口", cities: ["山口"] },
            { name: "徳島", cities: ["徳島"] },
            { name: "香川", cities: ["香川"] },
            { name: "愛媛", cities: ["愛媛"] },
            { name: "高知", cities: ["高知"] }
        ]
    },
    {
        region: "九州・沖縄",
        prefs: [
            { name: "福岡", cities: ["福岡", "北九州"] },
            { name: "佐賀", cities: ["佐賀"] },
            { name: "長崎", cities: ["長崎"] },
            { name: "熊本", cities: ["熊本"] },
            { name: "大分", cities: ["大分"] },
            { name: "宮崎", cities: ["宮崎"] },
            { name: "鹿児島", cities: ["鹿児島"] },
            { name: "沖縄", cities: ["沖縄"] }
        ]
    }
];