export const regionTree = [
    {
        region: "北海道・東北",
        prefs: [
            { name: "北海道", cities: ["札幌", "函館", "小樽", "富良野", "旭川", "稚内", "北海道"] },
            { name: "青森", cities: ["青森", "弘前", "八戸"] },
            { name: "岩手", cities: ["盛岡", "花巻"] },
            { name: "宮城", cities: ["仙台", "松島", "石巻", "宮城"] },
            { name: "秋田", cities: ["秋田", "角館"] },
            { name: "山形", cities: ["山形", "米沢"] },
            { name: "福島", cities: ["福島", "会津若松", "郡山"] }
        ]
    },
    {
        region: "関東",
        prefs: [
            { name: "茨城", cities: ["水戸", "ひたちなか", "日立", "土浦", "古河", "つくば", "鹿嶋", "守谷", "筑西", "坂東", "神栖", "茨城"] },
            {
                name: "栃木",
                cities: [
                    "宇都宮", "足利", "栃木", "佐野", "鹿沼", "日光", "小山", "真岡",
                    "大田原", "矢板", "那須塩原", "さくら", "那須烏山", "下野", "那須"
                ]
            },
            {
                name: "群馬",
                cities: [
                    "前橋", "高崎", "桐生", "伊勢崎", "太田", "沼田", "館林", "渋川",
                    "藤岡", "富岡", "安中", "みどり", "草津", "みなかみ"
                ]
            },
            { name: "埼玉", cities: ["さいたま", "所沢", "川越", "ふじみ野", "川口", "熊谷", "行田", "秩父", "飯能", "加須", "本庄", "東松山", "春日部", "狭山", "羽生", "鴻巣", "深谷", "上尾", "草加", "越谷", "蕨", "戸田", "入間", "朝霞", "志木", "和光", "新座", "久喜", "北本", "八潮", "富士見", "三郷", "蓮田", "坂戸", "幸手", "鶴ヶ島", "日高", "吉川", "白岡", "埼玉"] },
            {
                name: "東京（23区）",
                cities: [
                    "千代田", "中央", "港", "新宿", "文京", "台東", "墨田", "江東",
                    "品川", "目黒", "大田", "世田谷", "渋谷", "中野", "杉並", "豊島", "北",
                    "荒川", "板橋", "練馬", "足立", "葛飾", "江戸川"
                ]
            },
            {
                name: "東京（市町村）",
                cities: [
                    "八王子", "立川", "武蔵野", "三鷹", "青梅", "府中", "昭島", "調布",
                    "町田", "小金井", "小平", "日野", "東村山", "国分寺", "国立", "福生",
                    "狛江", "東大和", "清瀬", "東久留米", "武蔵村山", "多摩", "稲城",
                    "羽村", "あきる野", "西東京", "奥多摩"
                ]
            },
            { name: "神奈川", cities: ["横浜", "川崎", "相模原", "横須賀", "平塚", "鎌倉", "藤沢", "小田原", "茅ヶ崎", "逗子", "三浦", "秦野", "厚木", "大和", "伊勢原", "海老名", "座間", "南足柄", "綾瀬", "箱根"] },
            { name: "千葉", cities: ["千葉", "市川", "船橋", "松戸", "野田", "茂原", "成田", "佐倉", "東金", "習志野", "柏", "勝浦", "市原", "流山", "八千代", "我孫子", "鴨川", "鎌ケ谷", "君津", "浦安", "四街道", "木更津"] }
        ]
    },
    {
        region: "中部・北陸",
        prefs: [
            { name: "新潟", cities: ["新潟", "湯沢"] },
            { name: "富山", cities: ["富山", "黒部"] },
            { name: "石川", cities: ["金沢", "石川"] },
            { name: "福井", cities: ["福井", "敦賀"] },
            { name: "山梨", cities: ["甲府", "富士河口湖", "山梨"] },
            { name: "長野", cities: ["長野", "軽井沢", "松本"] },
            { name: "岐阜", cities: ["岐阜", "高山", "白川"] },
            { name: "静岡", cities: ["静岡", "浜松", "熱海", "伊東", "下田"] },
            { name: "愛知", cities: ["名古屋", "岡崎", "豊田", "犬山"] }
        ]
    },
    {
        region: "近畿",
        prefs: [
            { name: "三重", cities: ["津", "伊勢", "鳥羽", "三重"] },
            { name: "滋賀", cities: ["大津", "彦根"] },
            { name: "京都", cities: ["京都", "宇治", "天橋立"] },
            { name: "大阪", cities: ["大阪", "堺", "東大阪", "枚方"] },
            { name: "兵庫", cities: ["神戸", "姫路", "西宮", "城崎"] },
            { name: "奈良", cities: ["奈良", "生駒", "吉野"] },
            { name: "和歌山", cities: ["和歌山", "南紀白浜", "那智勝浦"] }
        ]
    },
    {
        region: "中国・四国",
        prefs: [
            { name: "鳥取", cities: ["鳥取", "米子"] },
            { name: "島根", cities: ["松江", "出雲"] },
            { name: "岡山", cities: ["岡山", "倉敷"] },
            { name: "広島", cities: ["広島", "福山", "廿日市"] },
            { name: "山口", cities: ["山口", "下関"] },
            { name: "徳島", cities: ["徳島", "鳴門"] },
            { name: "香川", cities: ["高松", "小豆島"] },
            { name: "愛媛", cities: ["松山", "今治"] },
            { name: "高知", cities: ["高知", "四万十"] }
        ]
    },
    {
        region: "九州・沖縄",
        prefs: [
            { name: "福岡", cities: ["福岡", "北九州", "太宰府"] },
            { name: "佐賀", cities: ["佐賀", "鳥栖"] },
            { name: "長崎", cities: ["長崎", "佐世保"] },
            { name: "熊本", cities: ["熊本", "阿蘇"] },
            { name: "大分", cities: ["大分", "別府", "由布院"] },
            { name: "宮崎", cities: ["宮崎", "延岡"] },
            { name: "鹿児島", cities: ["鹿児島", "指宿", "屋久島"] },
            { name: "沖縄", cities: ["那覇", "石垣", "宮古島", "沖縄"] }
        ]
    }
];